Repository: szymbaramichal/WasteFree
Catalog: API/WasteFree.Api/Resources/Shared.*.resx
Languages: pl_pl

# USERNAME_TAKEN
source: Username is already taken
pl_pl: Nazwa użytkownika jest już zajęta

# INVALID_REGISTRATION_TOKEN
source: Registration token has expired
pl_pl: Token aktywacyjny wygasł

source: Invalid user
pl_pl: Niepoprawny użytkownik

# FORBIDDEN
source: You are not privileged make this action.
pl_pl: Nie jesteś uprawniony do wykonania tej akcji.

# NOT_FOUND
source: Resource not found.
pl_pl: Nie znaleziono zasobu.

source: Invited user not found.
pl_pl: Nie znaleziono zaproszonego użytkownika.

# ALREADY_IN_GROUP
source: Invited user is already group member.
pl_pl: Użytkownik jest już członkiem grupy.

source: Empty image.
pl_pl: Pusty obraz.

# TOO_BIG_IMAGE
source: Too big image size. Max is 5mb.
pl_pl: Za duży rozmiar zdjęcia. Maksymalny rozmiar to 5mb.

source: Unsupported image type.
pl_pl: Niewspierany typ zdjęcia.

source: Invalid notification type.
pl_pl: Niepoprawy rodzaj notyfikacji.

# USER_NOT_ACTIVATED
source: Activate account via email link to make use of WasteFree Cloud!
pl_pl: Aktywuj najpierw konto przez link wysłany na adres email aby korzystać z WasteFree Cloud!

# CONSENT_NOT_FOUND
source: Consent entry was not found.
pl_pl: Nie znaleziono zgody.

# STH_WENT_WRONG
source: Oops, something went wrong. Please try again!
pl_pl: Ups, coś poszło nie tak. Spróbuj jeszcze raz!

source: Invalid payment code
pl_pl: Niepoprawny kod płatności

source: Invalid top up code.
pl_pl: Niepoprawny kod doładowania.

# MISSING_ACCOUNT_NUMBER
source: Before your withdrawal, fill up account number in profile.
pl_pl: Przed wypłatą musisz uzupełnić numer konta na swoim profilu.

# NOT_ENOUGH_FUNDS
source: Not enough funds to withdraw
pl_pl: Nie wystarczająca ilość do wypłaty

# PAYMENT_ALREADY_COMPLETED
source: Payment for this order has already been completed.
pl_pl: Płatność dla tego zamówienia została już zakończona.

# AMOUNT_OUTSIDE_RANGE
source: Amount must be between 1 and 10 000PLN.
pl_pl: Kwota płatności musi być w zakresie od 1 do 10 000PLN

# PAYMENT_PROPERTY_REQUIRED
source: Payment property is required
pl_pl: Właściwość płatności jest wymagana

# PAYMENT_CODE_REQUIRED
source: Payment method code is required
pl_pl: Kod płatności jest wymagany

# INVALID_ROLE
source: Invalid user role
pl_pl: Niepoprawna rola użytkownika

# INVALID_LANG
source: Invalid language
pl_pl: Niepoprawny język

# EMAIL_TAKEN
source: Email is already taken
pl_pl: Adres e-mail jest już zajęty

# LOGIN_FAILED
source: Login or password is incorrect
pl_pl: Login lub hasło są nieprawidłowe

# CONSENT_CONTENT_REQUIRED
source: Consent content is required.
pl_pl: Treść zgody jest wymagana.

# ERR_EMAIL_REQUIRED
source: Email is required
pl_pl: Adres e-mail jest wymagany

# ERR_EMAIL_INVALID
source: Email must be a valid email address
pl_pl: Adres e-mail jest nieprawidłowy

# ERR_USERNAME_REQUIRED
source: Username is required
pl_pl: Nazwa użytkownika jest wymagana

# ERR_PASSWORD_REQUIRED
source: Password is required
pl_pl: Hasło jest wymagane

# ERR_PASSWORD_TOO_SHORT
source: Password must be at least 8 characters long
pl_pl: Hasło musi mieć co najmniej 8 znaków

# ERR_GROUP_NAME_REQUIRED
source: Group name is required
pl_pl: Nazwa grupy jest wymagana

# ERR_GROUP_DESCRIPTION_REQUIRED
source: Group description is required
pl_pl: Opis grupy jest wymagany

# ERR_GROUP_CITY_REQUIRED
source: Group city is required
pl_pl: Miasto grupy jest wymagane

# ERR_GROUP_POSTAL_CODE_REQUIRED
source: Postal code is required
pl_pl: Kod pocztowy jest wymagany

# ERR_GROUP_POSTAL_CODE_INVALID
source: Postal code must follow format 00-000.
pl_pl: Kod pocztowy musi mieć format 00-000.

# ERR_GROUP_STREET_REQUIRED
source: Street is required
pl_pl: Adres grupy jest wymagany

# ERR_CHAT_MESSAGE_REQUIRED
source: Message cannot be empty.
pl_pl: Wiadomość nie może być pusta.

# ERR_CHAT_MESSAGE_TOO_LONG
source: Message is too long (max 2000 characters).
pl_pl: Wiadomość jest zbyt długa (maks. 2000 znaków).

# ERR_PICKUP_OPTION_INVALID
source: Pickup option is invalid
pl_pl: Opcja odbioru jest nieprawidłowa

# ERR_CONTAINER_SIZE_REQUIRED
source: Container size is required when pickup option is container
pl_pl: Rozmiar kontenera jest wymagany, gdy opcja odbioru to kontener

# ERR_PICKUP_DATE_REQUIRED
source: Pickup date is required
pl_pl: Data odbioru jest wymagana

# ERR_PICKUP_DATE_IN_PAST
source: Pickup date cannot be in the past
pl_pl: Data odbioru nie może być w przeszłości

# ERR_DROP_OFF_DATE_IN_PAST
source: Drop off date cannot be in the past
pl_pl: Data odbioru nie może być w przeszłości

# ERR_USER_IDS_EMPTY
source: At least one user must be selected for the order
pl_pl: Przynajmniej jeden użytkownik musi być wybrany do zamówienia
